stress-test/artillery-example.yml
config:
  target: 'http://localhost:3333'
  phases:
    - 
      duration: 60
      arrivalRate: 10
  environments:
    uat:
      target: "http://localhost:3333"
      http:
        tls: 
          rejectUnauthorized: false
    production:
      target: "http://localhost:3333"
      http:
        tls: 
          rejectUnauthorized: false
scenarios:
  - 
    name: "Test API URL"
    flow:
      - 
        get:
          url: "/api/v1/"